logs/fio-diskseq/slurm/001/log000.txt
+ cd /nfs/workloads/slurm
+ mkdir -p tmp
+ cd tmp
+ fio --rw=write --name=kube-fio-write --output-format=normal,terse --bs=256k --size=8G
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;103596;404;80974;0;0;0.000000;0.000000;71;95556;2466.274889;4901.933942;1.000000%=96;5.000000%=97;10.000000%=98;20.000000%=99;30.000000%=102;40.000000%=112;50.000000%=118;60.000000%=154;70.000000%=183;80.000000%=7700;90.000000%=8847;95.000000%=10682;99.000000%=16711;99.500000%=22675;99.900000%=45350;99.950000%=57409;99.990000%=87556;0%=0;0%=0;0%=0;74;95559;2470.072868;4901.683085;20480;1350514;100.000000%;103781.223602;121577.630826;0.203691%;5.289797%;7832;0;12;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;20.67%;55.56%;0.02%;0.00%;0.00%;0.00%;0.00%;18.31%;4.81%;0.56%;0.07%;0.00%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;63;2318;0;0;977;105154;106131;55.21%;slaves;90;30561;0;51;1674;282606;284827;99.46%;sda;90;30561;0;51;1674;282606;284827;99.46%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=132011: Sat Nov 18 14:55:11 2023
  write: IOPS=404, BW=101MiB/s (106MB/s)(8192MiB/80974msec); 0 zone resets
    clat (usec): min=71, max=95556, avg=2466.27, stdev=4901.93
     lat (usec): min=74, max=95559, avg=2470.07, stdev=4901.68
    clat percentiles (usec):
     |  1.00th=[   97],  5.00th=[   98], 10.00th=[   99], 20.00th=[  100],
     | 30.00th=[  103], 40.00th=[  113], 50.00th=[  119], 60.00th=[  155],
     | 70.00th=[  184], 80.00th=[ 7701], 90.00th=[ 8848], 95.00th=[10683],
     | 99.00th=[16712], 99.50th=[22676], 99.90th=[45351], 99.95th=[57410],
     | 99.99th=[87557]
   bw (  KiB/s): min=20480, max=1350514, per=100.00%, avg=103781.22, stdev=121577.63, samples=161
   iops        : min=   80, max= 5275, avg=405.27, stdev=474.91, samples=161
  lat (usec)   : 100=20.67%, 250=55.56%, 500=0.02%
  lat (msec)   : 10=18.31%, 20=4.81%, 50=0.56%, 100=0.07%
  cpu          : usr=0.20%, sys=5.29%, ctx=7832, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=101MiB/s (106MB/s), 101MiB/s-101MiB/s (106MB/s-106MB/s), io=8192MiB (8590MB), run=80974-80974msec

Disk stats (read/write):
    dm-0: ios=63/2318, merge=0/0, ticks=977/105154, in_queue=106131, util=55.21%, aggrios=90/30561, aggrmerge=0/51, aggrticks=1674/282606, aggrin_queue=284827, aggrutil=99.46%
  sda: ios=90/30561, merge=0/51, ticks=1674/282606, in_queue=284827, util=99.46%
+ fio --rw=read --name=kube-fio-read --output-format=normal,terse --bs=256k --size=8G
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-read;0;0;8388608;389063;1519;21561;0;0;0.000000;0.000000;23;143594;657.289127;3961.017672;1.000000%=25;5.000000%=27;10.000000%=28;20.000000%=31;30.000000%=34;40.000000%=37;50.000000%=38;60.000000%=39;70.000000%=49;80.000000%=56;90.000000%=67;95.000000%=3194;99.000000%=16056;99.500000%=16580;99.900000%=71827;99.950000%=85458;99.990000%=122159;0%=0;0%=0;0%=0;23;143594;657.365715;3961.014465;112640;483328;100.000000%;389262.883721;126490.664501;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.180891%;11.085343%;4668;0;144;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;70.02%;21.55%;0.03%;0.03%;0.02%;0.02%;2.70%;2.33%;1.50%;1.57%;0.12%;0.10%;0.02%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;3603;74;0;0;120628;25103;145731;93.67%;slaves;34770;952;66;1;1074517;32740;1107327;98.25%;sda;34770;952;66;1;1074517;32740;1107327;98.25%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=132080: Sat Nov 18 14:55:34 2023
  read: IOPS=1519, BW=380MiB/s (398MB/s)(8192MiB/21561msec)
    clat (usec): min=23, max=143594, avg=657.29, stdev=3961.02
     lat (usec): min=23, max=143594, avg=657.37, stdev=3961.01
    clat percentiles (usec):
     |  1.00th=[    26],  5.00th=[    28], 10.00th=[    29], 20.00th=[    32],
     | 30.00th=[    35], 40.00th=[    38], 50.00th=[    39], 60.00th=[    40],
     | 70.00th=[    50], 80.00th=[    57], 90.00th=[    68], 95.00th=[  3195],
     | 99.00th=[ 16057], 99.50th=[ 16581], 99.90th=[ 71828], 99.95th=[ 85459],
     | 99.99th=[122160]
   bw (  KiB/s): min=112640, max=483328, per=100.00%, avg=389262.88, stdev=126490.66, samples=43
   iops        : min=  440, max= 1888, avg=1520.56, stdev=494.10, samples=43
  lat (usec)   : 50=70.02%, 100=21.55%, 250=0.03%, 500=0.03%, 750=0.02%
  lat (usec)   : 1000=0.02%
  lat (msec)   : 2=2.70%, 4=2.33%, 10=1.50%, 20=1.57%, 50=0.12%
  lat (msec)   : 100=0.10%, 250=0.02%
  cpu          : usr=0.18%, sys=11.09%, ctx=4668, majf=0, minf=144
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=380MiB/s (398MB/s), 380MiB/s-380MiB/s (398MB/s-398MB/s), io=8192MiB (8590MB), run=21561-21561msec

Disk stats (read/write):
    dm-0: ios=3603/74, merge=0/0, ticks=120628/25103, in_queue=145731, util=93.67%, aggrios=34770/952, aggrmerge=66/1, aggrticks=1074517/32740, aggrin_queue=1107327, aggrutil=98.25%
  sda: ios=34770/952, merge=66/1, ticks=1074517/32740, in_queue=1107327, util=98.25%