logs/fio-diskseq/slurm/001/log006.txt
+ cd /nfs/workloads/slurm
+ mkdir -p tmp
+ cd tmp
+ fio --rw=write --name=kube-fio-write --output-format=normal,terse --bs=256k --size=8G
kube-fio-write: (g=0): rw=write, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-write;0;0;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;8388608;83526;326;100430;0;0;0.000000;0.000000;74;107083;2778.778799;5395.090595;1.000000%=95;5.000000%=96;10.000000%=97;20.000000%=99;30.000000%=111;40.000000%=114;50.000000%=123;60.000000%=168;70.000000%=191;80.000000%=7831;90.000000%=10551;95.000000%=12517;99.000000%=20578;99.500000%=30801;99.900000%=45875;99.950000%=48496;99.990000%=51118;0%=0;0%=0;0%=0;77;107086;2782.451936;5394.787987;10240;1844224;100.000000%;91918.065934;142400.361235;0.119486%;4.704769%;14321;3;21;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;0.00%;19.95%;55.57%;0.10%;0.00%;0.00%;0.22%;0.12%;13.86%;9.17%;0.99%;0.02%;0.01%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;90;4964;0;0;6498;140245;146743;59.86%;slaves;124;34198;0;61;9760;358510;369817;98.85%;sda;124;34198;0;61;9760;358510;369817;98.85%

kube-fio-write: (groupid=0, jobs=1): err= 0: pid=133105: Sat Nov 18 15:07:32 2023
  write: IOPS=326, BW=81.6MiB/s (85.5MB/s)(8192MiB/100430msec); 0 zone resets
    clat (usec): min=74, max=107083, avg=2778.78, stdev=5395.09
     lat (usec): min=77, max=107086, avg=2782.45, stdev=5394.79
    clat percentiles (usec):
     |  1.00th=[   96],  5.00th=[   97], 10.00th=[   98], 20.00th=[  100],
     | 30.00th=[  112], 40.00th=[  115], 50.00th=[  124], 60.00th=[  169],
     | 70.00th=[  192], 80.00th=[ 7832], 90.00th=[10552], 95.00th=[12518],
     | 99.00th=[20579], 99.50th=[30802], 99.90th=[45876], 99.95th=[48497],
     | 99.99th=[51119]
   bw (  KiB/s): min=10240, max=1844224, per=100.00%, avg=91918.07, stdev=142400.36, samples=182
   iops        : min=   40, max= 7204, avg=359.05, stdev=556.25, samples=182
  lat (usec)   : 100=19.95%, 250=55.57%, 500=0.10%
  lat (msec)   : 2=0.22%, 4=0.12%, 10=13.86%, 20=9.17%, 50=0.99%
  lat (msec)   : 100=0.02%, 250=0.01%
  cpu          : usr=0.12%, sys=4.70%, ctx=14321, majf=3, minf=21
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,32768,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=81.6MiB/s (85.5MB/s), 81.6MiB/s-81.6MiB/s (85.5MB/s-85.5MB/s), io=8192MiB (8590MB), run=100430-100430msec

Disk stats (read/write):
    dm-0: ios=90/4964, merge=0/0, ticks=6498/140245, in_queue=146743, util=59.86%, aggrios=124/34198, aggrmerge=0/61, aggrticks=9760/358510, aggrin_queue=369817, aggrutil=98.85%
  sda: ios=124/34198, merge=0/61, ticks=9760/358510, in_queue=369817, util=98.85%
+ fio --rw=read --name=kube-fio-read --output-format=normal,terse --bs=256k --size=8G
kube-fio-read: (g=0): rw=read, bs=(R) 256KiB-256KiB, (W) 256KiB-256KiB, (T) 256KiB-256KiB, ioengine=psync, iodepth=1
fio-3.35
Starting 1 process
3;fio-3.35;kube-fio-read;0;0;8388608;398130;1555;21070;0;0;0.000000;0.000000;34;146119;642.161520;4005.991855;1.000000%=35;5.000000%=36;10.000000%=36;20.000000%=37;30.000000%=38;40.000000%=38;50.000000%=39;60.000000%=41;70.000000%=44;80.000000%=47;90.000000%=62;95.000000%=1597;99.000000%=16056;99.500000%=16318;99.900000%=58982;99.950000%=85458;99.990000%=117964;0%=0;0%=0;0%=0;34;146119;642.228228;4005.990001;96256;491520;100.000000%;398238.476190;132098.383218;0;0;0;0;0;0;0.000000;0.000000;0;0;0.000000;0.000000;1.000000%=0;5.000000%=0;10.000000%=0;20.000000%=0;30.000000%=0;40.000000%=0;50.000000%=0;60.000000%=0;70.000000%=0;80.000000%=0;90.000000%=0;95.000000%=0;99.000000%=0;99.500000%=0;99.900000%=0;99.950000%=0;99.990000%=0;0%=0;0%=0;0%=0;0;0;0.000000;0.000000;0;0;0.000000%;0.000000;0.000000;0.147136%;11.832550%;3178;0;72;100.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.0%;0.00%;0.00%;0.00%;0.00%;81.16%;13.67%;0.02%;0.03%;0.02%;0.02%;0.69%;0.99%;0.94%;2.27%;0.04%;0.13%;0.02%;0.00%;0.00%;0.00%;0.00%;0.00%;dm-0;1819;62;0;0;65072;23178;88250;93.40%;slaves;33176;1037;88;2;992069;28420;1020517;98.89%;sda;33176;1037;88;2;992069;28420;1020517;98.89%

kube-fio-read: (groupid=0, jobs=1): err= 0: pid=133169: Sat Nov 18 15:07:54 2023
  read: IOPS=1555, BW=389MiB/s (408MB/s)(8192MiB/21070msec)
    clat (usec): min=34, max=146119, avg=642.16, stdev=4005.99
     lat (usec): min=34, max=146119, avg=642.23, stdev=4005.99
    clat percentiles (usec):
     |  1.00th=[    36],  5.00th=[    37], 10.00th=[    37], 20.00th=[    38],
     | 30.00th=[    39], 40.00th=[    39], 50.00th=[    40], 60.00th=[    42],
     | 70.00th=[    45], 80.00th=[    48], 90.00th=[    63], 95.00th=[  1598],
     | 99.00th=[ 16057], 99.50th=[ 16319], 99.90th=[ 58983], 99.95th=[ 85459],
     | 99.99th=[117965]
   bw (  KiB/s): min=96256, max=491520, per=100.00%, avg=398238.48, stdev=132098.38, samples=42
   iops        : min=  376, max= 1920, avg=1555.62, stdev=516.01, samples=42
  lat (usec)   : 50=81.16%, 100=13.67%, 250=0.02%, 500=0.03%, 750=0.02%
  lat (usec)   : 1000=0.02%
  lat (msec)   : 2=0.69%, 4=0.99%, 10=0.94%, 20=2.27%, 50=0.04%
  lat (msec)   : 100=0.13%, 250=0.02%
  cpu          : usr=0.15%, sys=11.83%, ctx=3178, majf=0, minf=72
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=32768,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=389MiB/s (408MB/s), 389MiB/s-389MiB/s (408MB/s-408MB/s), io=8192MiB (8590MB), run=21070-21070msec

Disk stats (read/write):
    dm-0: ios=1819/62, merge=0/0, ticks=65072/23178, in_queue=88250, util=93.40%, aggrios=33176/1037, aggrmerge=88/2, aggrticks=992069/28420, aggrin_queue=1020517, aggrutil=98.89%
  sda: ios=33176/1037, merge=88/2, ticks=992069/28420, in_queue=1020517, util=98.89%